nexus_app/app/controllers/scores_controller.rb

SELECT `scores`.* FROM `scores`
---
  def index
    @scores = Score.all

INSERT INTO `scores` (`description`, `subject_id`, `student_id`, `created_at`, `updated_at`, `score`) VALUES ('Final score', 1, 1, '2018-02-21 17:33:15', '2018-02-21 17:33:15', '32')
---
  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save

SELECT  `scores`.* FROM `scores` WHERE `scores`.`id` = 1 LIMIT 1
---
    def set_score
      @score = Score.find(params[:id])