nexus_app/app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

  def new
    @subject = Subject.new
    @teachers = Teacher.all
    @courses = Course.all
---
SELECT `teachers`.* FROM `teachers`
SELECT `courses`.* FROM `courses`

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO `subjects` (`name`, `teacher_id`, `course_id`, `created_at`, `updated_at`) VALUES ('Algorithms', 1, 1, '2018-02-21 17:16:16', '2018-02-21 17:16:16')

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 0 LIMIT 1